{"id": 87, "url": "https://conf.react.dev/code-of-conduct", "title": "React Conf 2024 Code of Conduct", "content": "'React Conf 2024', 'React Conf 2024 Code of Conduct', 'Purpose', 'The React Conf 2024 is committed to creating a welcoming and inclusive environment for all attendees, speakers, sponsors, volunteers, and staff. This Code of Conduct outlines our expectations to ensure a positive and respectful experience for everyone. All attendees, speakers, sponsors, volunteers, and staff members at our conference are required to agree with it. Organizers will enforce this code throughout the event. We expect cooperation from all participants to help ensure a safe environment for everybody.', 'The Quick Version', 'Our conference is dedicated to providing a harassment-free conference experience for everyone, regardless of gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion (or lack thereof), or technology choices. We do not tolerate harassment of conference participants in any form. Sexual language and imagery is not appropriate for any conference venue, including talks, workshops, parties, Twitter and other online media. Conference participants violating these rules may be sanctioned or expelled from the conference without a refund at the discretion of the conference organizers.', 'The Less Quick Version', 'Harassment includes offensive verbal comments related to gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion, technology choices, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention.', 'Participants asked to stop any harassing behavior are expected to comply immediately.', 'Sponsors are also subject to the anti-harassment policy. In particular, sponsors should not use sexualised images, activities, or other material. Booth staff (including volunteers) should not use sexualised clothing/uniforms/costumes, or otherwise create a sexualised environment.', 'If a participant engages in harassing behavior, the conference organizers may take any action they deem appropriate, including warning the offender or expulsion from the conference with no refund.', \"If you are being harassed, notice that someone else is being harassed, or have any other concerns, please contact a member of conference staff immediately. Conference staff can be identified as they'll be wearing branded clothing and/or badges.\", 'Conference staff will be happy to help participants contact hotel/venue security or local law enforcement, provide escorts, or otherwise assist those experiencing harassment to feel safe for the duration of the conference. We value your attendance.', 'We expect participants to follow these rules at conference and workshop venues and conference-related social events.', 'Unacceptable Behavior', 'Unacceptable behavior includes, but is not limited to:', 'Harassment: Harassment in any form, including verbal, physical, or visual, is strictly prohibited.', 'Discrimination: Discrimination based on gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion, technology choices, or any other protected characteristic is not tolerated.', 'Intimidation: Intimidating, bullying, or threatening behavior will not be tolerated.', 'Disruption: Disruptive behavior that hinders the conference experience for others is not acceptable.', 'Unauthorized Photography or Recording: Obtain explicit permission before taking photographs, recording, or live-streaming any conference-related content.', 'Reporting Violations', 'If you witness or experience any violations of this Code of Conduct, please report it to the conference organizers promptly:', 'By contacting a staff member, identified by staff t-shirts, in person', 'By sending an email to:', ' ', 'reactconf@callstack.com', 'When reporting, please provide as much information as possible, including description, location, date and time of the incident, the individuals involved, and any witnesses.', 'Your report will be handled with sensitivity, and confidentiality will be maintained to the extent possible while still addressing the issue.', 'Consequences', 'Participants who violate this Code of Conduct may face consequences, ranging from a verbal warning to expulsion from the conference without a refund. The severity of the consequences will depend on the nature and repetition of the violation.', 'Acknowledgment', 'By participating in the React Conf 2024, you acknowledge that you have read and agree to abide by this Code of Conduct. The conference organizers reserve the right to update or modify this Code of Conduct as needed.', 'This Code of Conduct is adapted from the', ' ', 'Conference Code of Conduct', '.', 'Newsletter', 'Subscribe now', 'Sign up to receive updates on speakers, the livestream, tickets, sponsors, and more', 'Subscribe', \"By clicking Subscribe you're confirming that you agree with our Terms and Conditions.\", \"Let's collaborate\", 'Contact us', 'reactconf@callstack.com', 'Past Conferences:', '2021', '2019', '2018', '2017', '2016', '2015', 'Code of Conduct', '© 2024 Callstack all rights reserved', "}